# Create Method

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
StructuralConnectionHandlerType..::..Create Method
StructuralConnectionHandlerType Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Create(Document, String, Guid, String) | Creates a new StructuralConnectionHandlerType object. |
| Create(Document, String, Guid, String, ElementId) | Creates a new StructuralConnectionHandlerType object. |
| Create(Document, String, Guid, String, ElementId, IList<(Of <<'(ConnectionInputPointInfo>)>>)) | Creates a new StructuralConnectionHandlerType object. |

# See Also
StructuralConnectionHandlerType Class
StructuralConnectionHandlerType Members
Autodesk.Revit.DB.Structure Namespace